{
  "backend/main.mo": "Defines the main canister with types and maps for sales, expenses, petty cash, inventory, and stock movements, plus comparison modules.",
  "backend/migration.mo": "Provides migration logic to add expenseType to old expense entries based on category.",
  "feature_evidence.json": "Lists feature evidence mapping UI changes to specific frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files and their responsibilities.",
  "frontend/index.css": "Defines Tailwind base layers and custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app with routing via state, query client provider, theme provider, and shell layout.",
  "frontend/src/components/AppShell.tsx": "Layout component providing header, navigation, mobile menu, main content area, and footer.",
  "frontend/src/components/ConfirmDialog.tsx": "Reusable confirmation dialog built on AlertDialog for destructive actions.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useExpenses.ts": "Provides React Query hooks to fetch and manage expense entries, including create, update, and delete mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for authentication, exposing identity state, login, and logout utilities.",
  "frontend/src/hooks/useInventory.ts": "Fetches inventory items and stock movements, computes stock levels, and provides mutations for adding items and movements.",
  "frontend/src/hooks/usePettyCash.ts": "Handles petty cash transactions with querying, balance calculation, and adding new transactions.",
  "frontend/src/hooks/useProfitAndLoss.ts": "Computes profit and loss reports from sales and expenses within a date range, including category breakdowns.",
  "frontend/src/hooks/useSales.ts": "Provides hooks to fetch and mutate sales entries, including create, update, and delete operations.",
  "frontend/src/index.css": "Defines Tailwind-based theme variables and styles for light and dark modes with a warm color palette.",
  "frontend/src/lib/dateUtils.ts": "Contains date parsing, formatting helpers, and a utility to filter entries by date range.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, rendering the main App component.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard with a hero section, module navigation cards, and a quick stats placeholder.",
  "frontend/src/pages/ExpensesPage.tsx": "Provides full CRUD for expenses with filtering, dialogs, category/type labels, and date‑range tools.",
  "frontend/src/pages/InventoryPage.tsx": "Manages inventory items and stock movements with add dialogs, tabs, and low‑stock tracking.",
  "frontend/src/pages/PettyCashPage.tsx": "Handles petty cash transactions, balance display, date filtering, and an add‑transaction dialog.",
  "frontend/src/pages/ReportsPage.tsx": "Generates profit and loss reports for a date range with summary metrics and category breakdowns.",
  "frontend/src/pages/SalesPage.tsx": "React page for listing, filtering, adding, editing, and deleting sales entries with dialogs, form handling, and toast notifications.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, fonts, animations, and plugin setup for the frontend UI.",
  "project_state.json": "Metadata file describing project state, features, requirements, and architectural notes for the restaurant management app."
}